#+TITLE: A Python API for accessing Scopus data

** scopus_api
  :PROPERTIES:
  :ID:       673FA81A-84FF-4453-9712-83904E755DB5
  :END:

This module implements the http://dev.elsevier.com/retrieval.html API. The main entry point is the ScopusAbstract class, which takes a [[http://kitchingroup.cheme.cmu.edu/blog/2015/06/07/Getting-a-Scopus-EID-from-a-DOI/][Scopus EID]] and an optional refresh boolean value. Retrieving these results is not fast, so we cache them to speed up subsequent uses of the code. Sometimes you may want new results, e.g. to get citation counts, and then you set refresh=True.

#+BEGIN_SRC python :results output org drawer :exports both
from scopus.scopus_api import ScopusAbstract

ab = ScopusAbstract("2-s2.0-84930616647", refresh=True)
print(ab)
#+END_SRC

#+RESULTS: 
:RESULTS:
[[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930616647&origin=inward][2-s2.0-84930616647]]  John R. Kitchin, Examples of effective data sharing in scientific publishing, ACS Catalysis, 5(6), p. 3894-3899, (2015). http://dx.doi.org/10.1021/acscatal.5b00538, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930616647&origin=inward, cited 2 times (Scopus).
Affiliations:
   id:60027950 Carnegie Mellon University
:END:


You can print the abstract in a variety of formats, including LaTeX, bibtex, HTML, and RIS. Here is an example. For bibtex entries, you get a uuid for the key.

#+BEGIN_SRC python :exports both
from scopus.scopus_api import ScopusAbstract

ab = ScopusAbstract("2-s2.0-84930616647")
print(ab.bibtex)
print(ab.ris)
#+END_SRC

#+RESULTS:
#+begin_example
@article{12b3dd94-d740-11e5-a03b-48d705e201bd,
  author = {John R. Kitchin},
  title = {Examples of effective data sharing in scientific publishing},
  journal = {ACS Catalysis},
  year = {2015},
  volume = {5},
  number = {6},
  pages = {3894-3899},
  doi = {10.1021/acscatal.5b00538}
}


TY  - JOUR
AU  - Kitchin J.R.
TI  - Examples of effective data sharing in scientific publishing
JO  - ACS Catalysis
VL  - 5
IS  - 6
DA  - 2015-06-05
SP  - 3894-3899
PY  - 2015
DO  - 10.1021/acscatal.5b00538
UR  - http://dx.doi.org/10.1021/acscatal.5b00538
ER  -


#+end_example

*** Interacting with the abstract
The abstract has a number of properties on it.
#+BEGIN_SRC python :exports both
from scopus.scopus_api import ScopusAbstract

ab = ScopusAbstract("2-s2.0-84930616647")
print([x for x in dir(ab) if '__' not in x])
#+END_SRC

#+RESULTS:
: ['affiliations', 'aggregationType', 'article_number', 'authors', 'authors_xml', 'bibtex', 'cite_link', 'citedby_count', 'coredata', 'coverDate', 'creator', 'description', 'doi', 'eid', 'endingPage', 'file', 'get_corresponding_author_info', 'html', 'identifier', 'issn', 'issueIdentifier', 'latex', 'nauthors', 'pageRange', 'publicationName', 'publisher', 'results', 'ris', 'scopus_link', 'self_link', 'source_id', 'srctype', 'startingPage', 'title', 'url', 'volume', 'xml']

Some of these are objects themselves. Here we consider the authors, which is a list of scopus.scopus_api.ScopusAuthor objects. These objects have quite a bit of information on them.

#+BEGIN_SRC python :exports both
from scopus.scopus_api import ScopusAbstract

ab = ScopusAbstract("2-s2.0-84930662492")
for au in ab.authors:
    print(au)

print([x for x in dir(au) if '__' not in x])
#+END_SRC

#+RESULTS:
: 1. John D. Michael scopusid:56673592900 affiliation_id:60027950
: 2. Ethan L. Demeter scopusid:55328415000 affiliation_id:60027950
: 3. Steven M. Illes scopusid:56674328100 affiliation_id:60027950
: 4. Qingqi Fan scopusid:56673468200 affiliation_id:60027950
: 5. Jacob R. Boes scopusid:56522803500 affiliation_id:60027950
: 6. John R. Kitchin scopusid:7004212771 affiliation_id:60027950
: ['affiliations', 'auid', 'author', 'author_url', 'given_name', 'indexed_name', 'initials', 'scopusid', 'seq', 'surname']

Another item of potential interest is the journal. Here we can access information about the journal impact factors of an article.

#+BEGIN_SRC python :exports both
from scopus.scopus_api import ScopusAbstract, ScopusJournal

ab = ScopusAbstract("2-s2.0-84930616647")

print(ScopusJournal(ab.issn))
#+END_SRC

#+RESULTS:
: ACS Catalysis http://www.scopus.com/source/sourceInfo.url?sourceId=19700188320
:     Homepage:
:     SJR:  3.277 (2014)
:     SNIP: 1.997 (2014)
:     IPP:  8.458 (2014)
:

** scopus_search
This is a class to enable you to perform a query and then retrieve the records of the query for analysis. The EIDs for the search are cached so subsequent analysis is quicker. This class mostly just provides a list of EIDs which you can use for the ScopusAbstract class.

#+BEGIN_SRC python :results output org drawer :exports both
from scopus.scopus_search import ScopusSearch

s = ScopusSearch('FIRSTAUTH ( kitchin  j.r. )', refresh=True)
print(s.org_summary)
#+END_SRC

#+RESULTS: 
:RESULTS:
1. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=0141924604&origin=inward][2-s2.0-0141924604]]  J.R. Kitchin, N.A. Khan, M.A. Barteau, J.G. Chen, B. Yakshinskiy and T.E. Madey, Elucidation of the active surface and origin of the weak metal-hydrogen bond on Ni/Pt(1 1 1) bimetallic surfaces: A surface science and density functional theory study, Surface Science, 544(2-3), p. 295-308, (2003). http://dx.doi.org/10.1016/j.susc.2003.09.007, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=0141924604&origin=inward, cited 112 times (Scopus).
  Affiliations:
   id:60023004 University of Delaware
   id:60030623 Rutgers, The State University of New Jersey
2. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=2942640180&origin=inward][2-s2.0-2942640180]]  J.R. Kitchin, J.K. Nørskov, M.A. Barteau and J.G. Chen, Modification of the surface electronic and chemical properties of Pt(111) by subsurface 3d transition metals, Journal of Chemical Physics, 120(21), p. 10240-10246, (2004). http://dx.doi.org/10.1063/1.1737365, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=2942640180&origin=inward, cited 539 times (Scopus).
  Affiliations:
   id:60011373 Danmarks Tekniske Universitet
   id:60023004 University of Delaware
4. [[http://www.scopus.com/inward/record.url?partnerID=HzOxMe3b&scp=84971324241&origin=inward][2-s2.0-84971324241]]  J.R. Kitchin and A.J. Gellman, High-throughput methods using composition and structure spread libraries, AIChE Journal, None, (no pages found) (2016). http://dx.doi.org/10.1002/aic.15294, http://www.scopus.com/inward/record.url?partnerID=HzOxMe3b&scp=84971324241&origin=inward, cited 0 times (Scopus).
  Affiliations:
   id:60027950 Carnegie Mellon University
5. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=20544467859&origin=inward][2-s2.0-20544467859]]  J.R. Kitchin, J.K. Nørskov, M.A. Barteau and J.G. Chen, Trends in the chemical properties of early transition metal carbide surfaces: A density functional study, Catalysis Today, 105(1 SPEC. ISS.), p. 66-73, (2005). http://dx.doi.org/10.1016/j.cattod.2005.04.008, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=20544467859&origin=inward, cited 85 times (Scopus).
  Affiliations:
   id:60011373 Danmarks Tekniske Universitet
   id:60023004 University of Delaware
6. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=13444307808&origin=inward][2-s2.0-13444307808]]  J.R. Kitchin, J.K. Nørskov, M.A. Barteau and J.G. Chen, Role of strain and ligand effects in the modification of the electronic and chemical Properties of bimetallic surfaces, Physical Review Letters, 93(15), (no pages found) (2004). http://dx.doi.org/10.1103/PhysRevLett.93.156801, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=13444307808&origin=inward, cited 451 times (Scopus).
  Affiliations:
   id:60011373 Danmarks Tekniske Universitet
   id:60023004 University of Delaware
7. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930616647&origin=inward][2-s2.0-84930616647]]  John R. Kitchin, Examples of effective data sharing in scientific publishing, ACS Catalysis, 5(6), p. 3894-3899, (2015). http://dx.doi.org/10.1021/acscatal.5b00538, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930616647&origin=inward, cited 2 times (Scopus).
  Affiliations:
   id:60027950 Carnegie Mellon University
8. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=40949100780&origin=inward][2-s2.0-40949100780]]  J.R. Kitchin, K. Reuter and M. Scheffler, Alloy surface segregation in reactive environments: First-principles atomistic thermodynamics study of Ag3 Pd(111) in oxygen atmospheres, Physical Review B - Condensed Matter and Materials Physics, 77(7), Art. No. 075437 (2008). http://dx.doi.org/10.1103/PhysRevB.77.075437, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=40949100780&origin=inward, cited 56 times (Scopus).
  Affiliations:
   id:60008644 Fritz Haber Institute of the Max Planck Society
   id:60027950 Carnegie Mellon University
9. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=67449106405&origin=inward][2-s2.0-67449106405]]  John R. Kitchin, Correlations in coverage-dependent atomic adsorption energies on Pd(111), Physical Review B - Condensed Matter and Materials Physics, 79(20), Art. No. 205412 (2009). http://dx.doi.org/10.1103/PhysRevB.79.205412, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=67449106405&origin=inward, cited 30 times (Scopus).
  Affiliations:
   id:60027950 Carnegie Mellon University
10. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930349644&origin=inward][2-s2.0-84930349644]]  John R. Kitchin, Data sharing in Surface Science, Surface Science, 647, p. 103-107, (2016). http://dx.doi.org/10.1016/j.susc.2015.05.007, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=84930349644&origin=inward, cited 0 times (Scopus).
  Affiliations:
   id:60027950 Carnegie Mellon University
11. [[https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=0037368024&origin=inward][2-s2.0-0037368024]]  J.R. Kitchin, M.A. Barteau and J.G. Chen, A comparison of gold and molybdenum nanoparticles on TiO2(1 1 0) 1 × 2 reconstructed single crystal surfaces, Surface Science, 526(3), p. 323-331, (2003). http://dx.doi.org/10.1016/S0039-6028(02)02679-1, https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=0037368024&origin=inward, cited 29 times (Scopus).
  Affiliations:
   id:60023004 University of Delaware

:END:


** scopus_author
This class differs from the author class described in [[id:673FA81A-84FF-4453-9712-83904E755DB5][scopus_api]]. This class is to interact with the entire author record in Scopus, using the author's scopus id. The ScopusAuthor object can access many bits of data about an author, including the number of papers, h-index, author impact factor, etc...

#+BEGIN_SRC python :exports both
from scopus.scopus_author import ScopusAuthor

au = ScopusAuthor(7004212771)
print([x for x in dir(au) if '__' not in x])
#+END_SRC

#+RESULTS:
: ['_affiliation_history', '_author_id', '_citedby_url', '_coauthor_url', '_current_affiliation', '_date_created', '_firstname', '_hindex', '_lastname', '_name', '_ncited_by', '_ncoauthors', '_ndocuments', '_orcid', '_scopus_url', 'affiliation_history', 'author_id', 'author_impact_factor', 'categories', 'citedby_url', 'coauthor_url', 'current_affiliation', 'date_created', 'firstname', 'get_abstracts', 'get_coauthors', 'get_document_eids', 'get_document_summary', 'hindex', 'lastname', 'level', 'n_first_author_papers', 'n_journal_articles', 'n_last_author_papers', 'name', 'ncitations', 'ncited_by', 'ncoauthors', 'ndocuments', 'orcid', 'results', 'scopus_url', 'xml']

#+BEGIN_SRC python :exports both
from scopus.scopus_author import ScopusAuthor

au = ScopusAuthor(7004212771)
print([a.name for a in au.get_coauthors()])
#+END_SRC

#+RESULTS:
: ['Stanislav V. Pandelov', 'John D. Michael', 'Yogesh V. Joshi', 'Gamze Gumuslu', 'Xu Zhou', 'John R. McCormick', 'Carmeline J. Dsilva', 'Steven M. Illes', 'Neetha A. Khan', 'Robin Chao', 'Erik J. Albenze', 'Nilay Inolu', 'Shelley L. Anna', 'Christina R. Myers', 'Anita S. Lee', 'Ethan L. Demeter', 'Walter Richard Alesi', 'Qingqi Fan', 'John D. Watkins', 'Sumathy Raman', 'Chunrong Yin', 'Áshildur Logadóttir', 'Prateek Mehta', 'Hari Thirumalai', 'Relja Vasić', 'Isabelacostinela Man', 'W. Richard Alesi', 'Peter L. Versteeg', 'Aaron Marks', 'Rumyana V. Petrova', 'Ashleigh E. Baber', 'Petro Kondratyuk', 'Lisa Mauck Weiland', 'Jingguang Chen', 'Ashish B. Mhadeshwar', 'Shayna L. Hilburg', 'Spencer D. Miller', 'Heather L. Tierney', 'Henry W. Pennline', 'Haiyan Su', 'Peter Kondratyuk', 'Kevin P. Resnik', 'Vladimir V. Pushkarev', 'Fei Gao', 'Charles Sykes', 'Edward S. Rubin', 'Nilay G. Inoǧlu', 'Boris V. Yakshinskiy', 'Ratiporn Munprom', 'Alexander P. Hallenbeck', 'Adefemi A. Egbebi', 'Matthew T. Curnan', 'Newell R. Washburn', 'José Ignacio Martínez', 'Zhongnan Xu', 'Edward M. Sabolsky', 'Krishnan V. Damodaran', 'James X. Mao', 'Morris Morris Bullock', 'Bryan D. Morreale', 'John A. Keith', 'Jacob R. Boes', 'Mitchell C. Groenenboom', 'Charles T. Campbell', 'Christopher J. Keturakis', 'Mc Mahan L Gray', 'Mark Barteau', 'Thomas Bligaard', 'Heine Anton Hansen', 'Inkyu Song', 'Christopher W. Jones', 'Kirk R. Gerdes', 'Hari Chandan Mantripragada', 'John R. Kitchin', 'Robert Lee Thompson', 'Hunaid B. Nulwala', 'Nicholas S. Siefert', 'Wei Shi', 'David P. Hopkinson', 'John C. Eslick', 'B. A. Calfa', 'Victor A. Kusuma', 'David R. Luebke', 'Federico Calle-Vallejo', 'David C M Miller', 'Jens Kehlet Nørskov', 'Sneha A. Akhade', 'Bruce C. Gates', 'Jan Rossmeisl', 'Evan Jacob Granite', 'James Landon', 'Dionisios G. Vlachos', 'James B. Miller', 'Ulrich Stimming', 'Israel E. Wachs', 'Anatoly I. Frenkel', 'Jingguang Chen', 'William D. Jones', 'Karsten Reuter', 'Susannah Scott', 'E. Charles H Sykes', 'Andrew J. Gellman', 'David S. Sholl', 'Jeongwoo Han', 'Paul A. Salvador', 'Marc T M Koper', 'R. J. Gorte', 'Thomas Francisco Jaramillo', 'Theodore E. Madey', 'Hannes Jónsson', 'Lars Lindqvist', 'Terrence J. Collins', 'Matthias Scheffler']


You can generate a report about an author just by printing it.

#+BEGIN_SRC python :exports both :results output org drawer
from scopus.scopus_author import ScopusAuthor

au = ScopusAuthor(7004212771)
print(au)
#+END_SRC

#+RESULTS:
:RESULTS:
